[{"title":"我是怎么思考前端工程的","date":"2016-12-16T17:05:42.000Z","path":"2016/12/17/我是怎么思考前端工程的/","text":"这是公司技术分享会上的分享笔记 前端目标： 对现有优秀框架的了解与整合使用 根据项目的业务特点构建出合适的开发模式 设计前端测试方案保证代码质量 用工程化方案组织起团队的开发流程。 发展历程 历程 经历 WEB 1.0 官网 php asp jsp 交易平台 ajax富应用时代 交易平台后台 工程化大前端 万有 VR、可穿戴设备、智能家电… 拉仇恨定律：任何能够用JavaScript实现的应用系统，最终都必将用JavaScript实现。 —— Atwood 痛点 代码耦合，前后端协作不顺畅 前端工作流程繁琐 代码复用性差，服务器压力大，后端API不通用 首屏时间长，javascript代码增量大 状态难以管理 路由控制 组件化 依赖难以管理 新语法的兼容性(浏览器) 可维护性(全局变量) 前端专属的开发服务器 前端测试 万有前端的解决方案 面向企业 管理系统 前后端分离 webpack自动构建 SPA =&gt; webpack打包 按需加载 react react-router Redux(flux) npm babel es6 模块化 webpack-dev-server karma react 组件化使应用程序更易于开发和维护学习曲线平缓，核心 API 简洁清晰，易于学习JSX 语法不落俗套，充分发挥了 JavaScript 的能量天生适配 Flux 和 Redux社区活跃且具有创造力，奉献了诸多优秀的开发工具单向数据流比双向数据绑定的方式更适合复杂应用程序，质量更高支持服务端 webpack 通过配置可以应对各种情况支持主流的模块加载方式（AMD，CommonJS，globals）内部机制可以修复破损的模块可以处理 CSS全面的缓存系统支持热重载可以加载大多数的资源提供高效的性能优化方案 改进： jquery （fetch）react-bootstrapstate （redux）test （karma）动画","tags":[]},{"title":"my beatiful lover [Prisma]","date":"2016-12-07T15:56:02.000Z","path":"2016/12/07/相册/","text":"","tags":[{"name":"照片","slug":"照片","permalink":"http://suncafe.cc/tags/照片/"}]},{"title":"谈谈工具","date":"2016-04-08T14:33:32.000Z","path":"2016/04/08/谈谈工具/","text":"前一阵子Adobe公司发布了一款新软件叫Adobe XD，传言是Sketch的劲敌。Sketch也在设计圈里火了有段日子了，不过由于只有OS版本，在国内难以达到UI标配的程度。然而显然PS在界面设计方面是有点臃肿的，UI行业火爆到开始平息的时候新软件的出现为时不晚。如果如果XD发布windows版本，那么Sketch就真的有成为过客的危险了。 高中毕业时候我在书店里买了一本Photoshop教程书，那时谈不上设计，但那时已是我接触生产力工具的启蒙，我被复杂的界面所倾倒，被变换的像素所震撼，被未知的强大所吸引。掰掰手指已是四年多，CS456到CC软件也算是伴随着我成长。如今我做前端的工作，每天面对更多的是文本编辑器和命令行工具，PS打开的时候越来越少了，这让我总有些不舍。 如今的互联网行业真的是日新月异，各类开发设计原型巴拉巴拉的工具比比皆是群芳争艳乐此不疲。这其中自然也不乏开天辟地的神作。所有的工具都凝聚了开发人员的心血与智慧，然而并不是所有工具都适合你，选择自然是个问题。1.最重要的你要做的是什么2.有什么可选择你问google3.别被学习曲线吓到也别死磕4.计算时间成本 本想总结一下前端开发工具然而发现善良的好多网友总结的比我的全的多，那么我来开启传送门。http://www.fefork.com/fetool/感谢@nieweidong的前端工具集。 另外今晚最重要的一句：真诚的向程序开发人员致敬！","tags":[{"name":"工具","slug":"工具","permalink":"http://suncafe.cc/tags/工具/"}]},{"title":"今天是个值得庆祝的好日子","date":"2016-04-07T16:38:59.000Z","path":"2016/04/08/今天是个值得庆祝的好日子/","text":"原因很简单，因为我开通了博客，哈哈哈 还要练习使用markdown呢，希望自己坚持下去 这篇博客呢，主要是记录一下自己的前端学习笔记，以及自己想说的话 万事开头难，今天折腾了好久终于把博客搭建起来，感谢google 感谢网上所有无私奉献的人们 千里之行始于足下，滴水穿石巴拉巴拉~ Hello word！","tags":[{"name":"碎碎念","slug":"碎碎念","permalink":"http://suncafe.cc/tags/碎碎念/"},{"name":"深井冰","slug":"深井冰","permalink":"http://suncafe.cc/tags/深井冰/"}]},{"title":"Hello World","date":"2016-04-07T12:53:47.000Z","path":"2016/04/07/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]